Repository: 84000/data-translation-memory
Catalog: toh248-v3.tmx
Source language: bo
Languages: en

source: ཤཱ་རིའི་བུ་དེ་ལྟ་བུའི་བསྟི་སྟང་གིས་ཆོས་ངེས་པར་ཡོངས་སུ་ཚོལ་བ་པོའི་སེམས་ཅན་ཡང་རྙེད་དཀའ་བ་ཡིན། ཤཱ་རིའི་བུ་དེ་ལྟ་བུའི་བསྟི་སྟང་གིས་ཆོས་ཡོངས་སུ་འཛིན་པ་པོའི་སེམས་ཅན་ཡང་རྙེད་དཀའ་བ་ཡིན། ཤཱ་རིའི་བུ་དེ་ལྟ་བུའི་བསྟི་སྟང་གིས་ཆོས་སྦྱིན་པ་པོའི་སེམས་ཅན་ཡང་རྙེད་དཀའ་བ་ཡིན་ཏེ། གང་རྙེད་དཀའ་བ་དེ་ནི་ངོ་མཚར་དུ་གྱུར་པ་ཡིན་ལ། དེ་དག་ནི་ལྷ་དང་བཅས་པའི་འཇིག་རྟེན་གྱིས་ཀྱང་བསྔགས་པར་བྱ་བ་ཡིན་ནོ། ། ཤཱ་རིའི་བུ་ཆོས་གསུམ་པོ་འདི་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔའ་བསྔགས་པའི་བྱ་བ་རྗེས་སུ་འཐོབ་པར་འགྱུར་རོ། ། ཤཱ་རིའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་འདི་ལ་འདོད་ཆགས་སྐྱེ་བར་ཡང་དག་པར་རྗེས་སུ་མཐོང་བ་ན་འདོད་ཆགས་འདི་གཞི་གང་ལས་བྱུང་བ་ཚོལ་བར་བྱེད་དེ་ ཡོངས་སུ་བཙལ་བ་ན་དེའི་གཞི་མི་དམིགས་སོ། ། གང་ལས་འདོད་ཆགས་དེ་སྐྱེ་བ་དང་། གང་གི་འདོད་ཆགས་དེ་སྐྱེ་བ་དང་། ཇི་ལྟར་འདོད་ཆགས་དེ་སྐྱེ་བ་དེ་ལྟར་གང་གི་སྐྱེ་བ་དེ་མི་དམིགས། གང་ལ་སྐྱེ་བ་དེ་མི་དམིགས།
en: “Śāriputra, sentient beings who pursue the Dharma with such devotion are rare indeed. Śāriputra, sentient beings who uphold the Dharma with such devotion are rare indeed. Śāriputra, sentient beings who practice giving the Dharma with such devotion are rare indeed. Such a rarity is a marvel, and those bodhisattvas are to be praised by the world with its gods. Śāriputra, bodhisattvas who have these three qualities will be praised.

source: ཇི་ལྟར་སྐྱེ་བ་དེ་མི་དམིགས་ཏེ། འདོད་ཆགས་དེ་མི་དམིགས་པ་ནི་འདོད་ཆགས་ཀྱི་རྒྱུས་སྡིག་པའི་ལས་མི་བྱེད་ལ། དེའི་དཀར་པོའི་ཆོས་རྣམས་འཕེལ་བར་འགྱུར་ཞིང་དེ་མ་སྨད་ཅིང་བསྔགས་པར་འགྱུར་ཏེ དེས་ན་ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། མི་དང་། མི་མ་ཡིན་པ་དང་། སངས་རྒྱས་དང་ཉན་ཐོས་རྣམས་ཀྱིས་བསྔགས་པར་འགྱུར་རོ། ། དེ་ཆོས་ཐམས་ཅད་ཁས་མི་ལེན་ཅིང་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་། ཆོས་ཐམས་ཅད་ནམ་མཁའ་དང་མཉམ་པར་སྟོང་པར་མཐོང་ཞིང་དེ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱི་བྱང་ཆུབ་ལ་ལྷག་པར་མོས་པར་འགྱུར་ཏེ།
en: “Furthermore, Śāriputra, when bodhisattvas observe in themselves the arising of desire, they look for the ground from which this desire has arisen. When they look carefully, they cannot find that ground. They cannot find the place whence that desire has arisen, whose desire has arisen, the means by which that desire has arisen, for whom it has arisen, or how it has arisen. As that desire cannot be found, they do not engage in negative actions motivated by desire. Rather, their positive qualities increase, and they are not criticized—they are praised. Consequently, they are praised by gods, nāgas, yakṣas, humans, nonhumans, buddhas, and śrāvakas. They do not affirm, and they do not observe, any phenomenon. They see that all phenomena are empty like space, and they become intensely dedicated to the awakening of the blessed buddhas.

source: འཇིག་རྟེན་རྣམས་ཕྱིན་ཅི་ལོག་ལ་ཡང་དག་པར་ཞེན་པ་མཐོང་བ་ན་དེ་ཞེ་སྡང་མེད་པ་དང་། གནོད་སེམས་མེད་པ་བཟོད་པ་མཆོག་ལ་རབ་ཏུ་གནས་ནས་ སྦྱིན་པ་དང་། ཚུལ་ཁྲིམས་དང་། བཟོད་པ་དང་། བརྩོན་འགྲུས་དང་། བསམ་གཏན་དང་། ཤེས་རབ་རྣམས་ལ་བརྩོན་འགྲུས་རྩོམ་ཞིང་སེམས་ཅན་རྣམས་ཡོངས་སུ་སྨིན་པར་བྱེད་དོ། ། དེ་ཅིའི་ཕྱིར་ཞེ་ན། གལ་ཏེ་གནོད་སེམས་དང་ལྡན་ན་ནི་ཁོང་ཁྲོ་བ་མང་བར་འགྱུར་རོ། ། ཁོང་ཁྲོ་བ་མང་བ་ལས་ནི་གཞན་དག་ལ་ཁྲོ་བའི་ཚིག་རྗོད་པར་བྱེད་དེ། དེ་མི་དགེ་བའི་ལས་མངོན་པར་འདུ་བྱེད་དོ། ། དེ་མི་དགེ་བའི་ལས་མངོན་པར་འདུ་བྱེད་པས་མི་དགེ་བའི་སྲིད་པ་མངོན་པར་སྐྱེད་པར་འགྱུར་རོ། ། ཤཱ་རིའི་བུ་ཡང་བཟོད་པ་དང་ལྡན་པའི་བྱང་ཆུབ་སེམས་དཔའ་ནི་བཟོད་པར་བྱེད་དོ། ། དེ་ཅིའི་ཕྱིར་ཞེ་ན། གང་བཟོད་པའམ། མི་བཟོད་པའི་ཆོས་རྡུལ་ཙམ་ཡང་མི་དམིགས་པ་དེས་ན་གཞན་མི་ཤེས་པའི་སེམས་ཅན་གང་ཡིན་པ་དེ་དག་ལ་སྙིང་རྗེ་སྐྱེད་པར་བྱེད་དེ། སེམས་ཅན་ཀུན་ནས་གཤེ་བར་བྱེད་པ་དང་། ཀུན་ནས་ཁྲོ་བར་བྱེད་པ་དང་། ཡོངས་སུ་སྤྱོ་བར་བྱེད་པ་དེ་དག་ཉིད་ལ་སྙིང་རྗེ་སྐྱེད་པར་བྱེད་དོ། ། དེས་ན་བྱམས་པ་ཆེན་པོ་བསྒོམས་པ་ཡིན། དགེ་བའི་ཆོས་རྣམས་ཀྱང་བསྒོམས་པ་ཡིན་ཏེ།
en: “When they see worldly people fixated on wrong views, they are without anger and ill will. Established in supreme patience, they endeavor in generosity, discipline, patience, diligence, concentration, and insight, and they bring sentient beings to maturity. Why? Because, when ill will is present, aggression increases. When aggression increases, angry words are spoken to others, and this creates nonvirtuous karma. As a result, unfortunate existences will come to be.

source: བཟོད་པ་དེ་དང་ལྡན་ན་བཟོད་པ་མཆོག་ཐོབ་པ་གང་ཡིན་པ་འདི་ནི་རྗེས་སུ་འཐུན་པའི་བཟོད་པ་ཡིན་ཏེ། དེ་སྙིང་རྗེ་ཆེན་པོ་དང་ལྡན་པས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས་སེམས་ཅན་རྣམས་ལ་ཆོས་སྟོན་པར་བྱེད། དེ་དཀའ་བ་སྤྱོད་པར་བྱེད་ཅིང་བཟོད་པ་དཀའ་བ་བྱེད་དེ། དེས་ན་བཟོད་པ་མཆོག་ཐོབ་པར་བྱེད། དེས་ན་ཐོགས་པ་མེད་པའི་ཡེ་ཤེས་མཐོང་བ་ཐོབ་པར་བྱེད། དེས་ན་སྣ་ཚོགས་པ་མེད་པའི་ཡེ་ཤེས་མཐོང་བ་ཐོབ་པར་བྱེད། དེས་ན་ཆགས་པ་མེད་པའི་ཡེ་ཤེས་མཐོང་བ་ཐོབ་པར་བྱེད་དོ། ། ཤཱ་རིའི་བུ་ཆོས་བཞི་པོ་འདི་དག་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔའ་བསྔགས་པའི་བྱ་བ་རྗེས་སུ་འཐོབ་པར་འགྱུར་རོ། ། ཤཱ་རིའི་བུ་གཞན་ཡང་ཆོས་བཞི་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔའ་སྐྱེ་བ་དྲན་པར་འགྱུར་ཏེ། བཞི་གང་ཞེ་ན། ཤཱ་རིའི་བུ་འདི་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་ཇི་སྐད་སྨྲ་བ་དེ་བཞིན་དུ་བྱེད་པ་ཡིན། ཇི་ལྟར་བྱེད་པ་དེ་བཞིན་དུ་སྨྲ་བ་ཡིན། ཁྲོ་བ་སྐྱེས་པ་ཡང་སྤོང་བར་བྱེད། རབ་ཏུ་སྤོང་བར་བྱེད།
en: “Śāriputra, patient bodhisattvas act with endurance. Why? Because by not apprehending any difference whatsoever between endurable and unendurable phenomena, they have compassion for sentient beings who do not know otherwise. They have compassion for sentient beings who completely criticize them, who completely abuse them, and who completely deprecate them. This shows that they have cultivated great love and virtuous qualities. This kind of patience—the attainment of supreme patience—is known as the concordant patience. Through their great compassion, bodhisattvas awaken in a perfect manner to unexcelled and perfect buddhahood, and they then teach the Dharma to sentient beings. Undertaking difficulties and hardships, they attain supreme patience, unimpeded wisdom and vision, undivided wisdom and vision, and unattached wisdom and vision. Śāriputra, when bodhisattvas have those four qualities they will be praised.

source: རྣམ་པར་སེལ་བར་བྱེད་ཅིང་ཡེ་ཤེས་ལ་རབ་ཏུ་རྟོན་པར་འགྱུར་བ་ཡིན་ཏེ། ཤཱ་རིའི་བུ་འདི་ལྟ་སྟེ། དཔེར་ན་མེ་མདག་ཆེན་པོས་གང་བའི་དོང་ནི་ཆུའི་ཕུང་པོ་ཆེན་པོས་ཉེ་བར་ཞི་བར་བྱེད་དོ། ། ཤཱ་རིའི་བུ་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་ཁྲོ་བ་སྐྱེས་པ་སྤོང་བར་བྱེད་པ་དང་། སེལ་བར་བྱེད་པ་དང་། ཡེ་ཤེས་ལ་རྟོན་པར་བྱེད་པར་འགྱུར་རོ། ། ཤཱ་རིའི་བུ་ཆོས་དང་པོ་འདི་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔའ་སྐྱེ་བ་དྲན་པར་འགྱུར་རོ། །
en: “Furthermore, Śāriputra, bodhisattvas who have four qualities will remember their past lives. What are these four? Śāriputra, bodhisattvas’ acts accord with their words, and their words accord with their acts. They abandon, renounce, and rid themselves of aggression, and they rely on wisdom. As an analogy, Śāriputra, a pit filled with burning embers is extinguished by a great mass of water. Similarly, Śāriputra, bodhisattvas abandon and rid themselves of aggression, and they rely on wisdom. Śāriputra, bodhisattvas who have this first quality will remember their past lives.

source: ཤཱ་རིའི་བུ་གཞན་ཡང་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་ཐོས་པ་ཚོལ་བ་ལ་གནས་ཤིང་དགེ་བའི་ཆོས་ཐམས་ཅད་ཚོལ་བ་ན་གཅེས་པ་མི་འདོར་བ་ཡིན། ཉམས་འོག་ཏུ་ཆུད་པའི་ཐོས་པ་མང་པོ་དང་ལྡན་པ་ཡིན། དེ་གང་དང་གང་དུ་འགྲོ་བ་ཐམས་ཅད་དུ་འདོད་པའི་བྱ་བ་རྗེས་སུ་འཐོབ་པར་འགྱུར་ལ། གཞན་དག་ཀྱང་ཐོས་པ་མང་པོ་ལ་འགོད་པར་བྱེད་ཅིང་ཆོས་དེ་དག་ལ་ཡང་ཚུལ་བཞིན་དུ་སོ་སོར་རྟོག་པར་བྱེད་དེ འཆི་བའི་དུས་ཀྱི་ཚེ་ཡང་ཆོས་དང་ལྡན་པའི་དྲན་པས་གནས་པར་འགྱུར་རོ། །
en: “Furthermore, Śāriputra, bodhisattvas who pursue learning and all virtuous qualities never forsake what is essential. They possess much masterful learning. Wherever they go, their wishes are fulfilled. They establish others at the level of erudition, and they cause them to understand the Dharma correctly. At the time of death, they will remain mindful of the Dharma.

source: ཤཱ་རིའི་བུ་འདི་ལྟ་སྟེ་དཔེར་ན་སྐྱེས་བུ་ཞིག་རྩེ་བ་དང་དགའ་བས་ཡོངས་སུ་སྤྱོད་པས་ལམ་དུ་ཞུགས་པ་ན་དེ་དུས་དེའི་ཚེ་བཀྲེས་པར་གྱུར་ལ། དེ་དུས་ཕྱིས་ཞིག་ན་སྔོན་གྱི་རྩེ་བ་དང་དགའ་བ་དེ་རྗེས་སུ་དྲན་པར་གྱུར་པ་ན་འདི་ལྟར་དེ་སྔོན་གྱི་ཡིད་ལ་བྱེད་པ་དེས་བཀྲེས་པ་ཡོད་པ་སེལ་བར་བྱེད་དོ། ། ཤཱ་རིའི་བུ་དེ་བཞིན་དུ་དུས་གང་གི་ཚེ་བྱང་ཆུབ་སེམས་དཔའ་འཆི་བའི་དུས་ཀྱི་ཚོར་བས་ཉེན་པ་དེའི་ཚེ་ཆོས་དང་ལྡན་པའི་ཡིད་ཀྱིས་དང་དུ་ལེན་པར་བྱེད་དེ་དེ་ ཤེས་བཞིན་དང་ལྡན་པར་འགྱུར་རོ། ། དེས་ཤེས་བཞིན་དང་ལྡན་པས་མའི་མངལ་དུ་འཇུག་ཅིང་དེར་གནས་ན་ཡང་དྲན་པ་དང་ལྡན་པར་འགྱུར་རོ། ། ཤཱ་རིའི་བུ་ཆོས་གཉིས་པོ་འདི་དག་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔའ་སྐྱེ་བ་དྲན་པར་འགྱུར་རོ། །
en: “As an analogy, Śāriputra, when people set out traveling with an attitude of playfulness and delight, they may get hungry. However, if they later remind themselves of their playfulness and delight, the thought of their prior state will dispel their hunger. Similarly, Śāriputra, when bodhisattvas are pressed by the feeling of impending death, they readily accept it with a mind turned toward the Dharma, and they become alert. If they enter a mother’s womb and remain there with this alertness, they will retain their memory. Śāriputra, bodhisattvas who have these two qualities will remember their past lives.

source: ཤཱ་རིའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་དག་ལེགས་པར་བསྲུང་བ་ཡིན་ཏེ། དེ་གཞན་ལ་གཤེ་བར་མི་བྱེད་དེ། གཏི་མུག་པ་ཞེའམ། རྨོངས་པ་ཞེའམ། ཁེངས་པ་ཞེའམ། ལོང་བ་ཞེའམ། འཐེང་པོ་ཞེས་གཞན་ལ་ཁྲོ་བ་སྐྱེད་པས་གནས་པ་མ་ཡིན་ནོ། ། གཞན་དུ་ན་སེམས་ཅན་ཁྲོས་པ་གང་ཡིན་པ་དེ་ལ་དབུགས་འབྱིན་པར་བྱེད། བཟོད་པ་གསོལ་བར་བྱེད། རྗེས་སུ་འཐུན་པར་བྱེད། ཆོས་ཀྱིས་དགའ་བར་བྱེད། དྲན་པ་ལ་ཉེ་བར་གནས་པར་བྱེད། དེ་ལ་གསོང་པོར་སྨྲ་བར་བྱེད། ཚུར་ཤོག་ལེགས་པར་འོངས་སོ་ཞེས་སྨྲ་བར་བྱེད་དེ། མ་འཇིགས་ཤིག །མ་འཇིགས་ཤིག་ཅེས་སེམས་ཅན་དེ་དག་ལ་མི་འཇིགས་པ་སྦྱིན་པར་བྱེད། དབུགས་འབྱིན་པར་བྱེད་དེ། ཡིད་ཆེས་པར་བྱེད་ཅིང་བཟོད་པ་གསོལ་བར་བྱེད། རྗེས་སུ་འཐུན་པར་བྱེད་དོ། ། སེམས་ཅན་འཁྲུལ་པའི་སྤྱོད་པ་དག་ལས་ཀྱང་ཀུན་ནས་སློང་བར་བྱེད་དེ།
en: “Furthermore, Śāriputra, bodhisattvas guard their speech carefully. They do not criticize others. They do not behave aggressively toward others, calling them ‘ignorant,’ ‘deluded,’ ‘conceited,’ ‘blind,’ or ‘crippled.’ Instead, they provide aggressive beings with relief, patience, and harmony. They delight them with the Dharma, they establish them in mindfulness, and they speak to them sincerely. They give them the gift of fearlessness, saying, ‘Please come, you are welcome here. Do not be afraid! Do not be afraid!’ They bring relief to those beings, and they instill confidence, patience, and harmony in them. They are motivated to act when they see sentient beings’ confused behavior. Śāriputra, bodhisattvas who have these three qualities will remember their past lives.

source: ཤཱ་རིའི་བུ་ཆོས་གསུམ་པོ་འདི་དག་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔའ་སྐྱེ་བ་དྲན་པར་འགྱུར་རོ། ། ཤཱ་རིའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་འདི་ལ་དགེ་བའི་ཆོས་རྣམས་ལས་ཤིན་ཏུ་འདས་ཤིང་དགེ་བའི་ཆོས་རྣམས་དང་ལྡན་པར་འགྱུར་བ་དང་། དེ་དེ་ལ་གནས་ནས་ གཞན་དག་ཀྱང་དེ་ལ་རབ་ཏུ་འགོད་པར་བྱེད་པ་དང་། བསྟི་སྟང་གིས་ཆོས་ཡོངས་སུ་ཚོལ་བར་བྱེད་པ་དང་། གཞན་དག་ལ་རྒྱ་ཆེར་སྟོན་པར་བྱེད་དེ ཤཱ་རིའི་བུ་ཆོས་བཞི་པོ་འདི་དག་དང་ལྡན་པའི་བྱང་ཆུབ་སེམས་དཔའ་སྐྱེ་བ་དྲན་པར་འགྱུར་རོ། །
en: “Furthermore, Śāriputra, such bodhisattvas, while thoroughly transcending virtuous qualities, will possess virtuous qualities. They dwell in them, and also firmly establish others in them. With devotion they seek out the Dharma and teach it extensively to others. Śāriputra, bodhisattvas who have these four qualities will remember their past lives.

source: དེ་སྐྱེ་བ་དྲན་པས་གནས་ལྔ་རབ་ཏུ་འཐོབ་པ་ཡིན་ཏེ། ལྔ་གང་ཞེ་ན། སྔོན་ཐོས་པའི་ཆོས་གང་ཡིན་པ་དེ་དག་ལ་དེ་བཞིན་དུ་མངོན་པར་འཇུག་པ་ཉིད་དང་། དྲན་པ་མཆོག་ཏུ་འགྱུར་བ་དང་། ཤེས་རབ་རྣོ་བ་དང་། དྲན་པ་མཆོག་དང་། ཤེས་རབ་དང་ལྡན་པ་དང་། དེ་སྲོག་གི་ཕྱིར་ཡང་སྡིག་པའི་ལས་མི་བྱེད་པ་སྟེ། སྐྱེས་མ་ཐག་ཏུ་ཆོས་ལྔ་པོ་འདི་དག་འཐོབ་པར་འགྱུར་རོ། ། ཤཱ་རིའི་བུ་ཆོས་འདི་བཞི་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ལ་མེད་དེ།
en: “By remembering their past lives, bodhisattvas will attain five qualities. What are these five? Adherence to and perfect memory of the teachings they have heard previously, sharp insight, supreme recollection, insight, and avoidance of negative actions—even at the cost of their life. As soon as they are born, they will attain these five qualities.

source: བཞི་གང་ཞེ་ན། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ལ་གཡོ་མེད་དོ། ། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ལ་སེར་སྣ་མེད་དོ། ། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ལ་ཕྲག་དོག་དང་ཕྲ་མ་མེད་དོ། ། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ལ་བདག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་མི་ནུས་སོ་སྙམ་དུ་ཞུམ་པའི་སེམས་མེད་དོ། ། ཤཱ་རིའི་བུ་གང་ལ་ཆོས་བཞི་པོ་འདི་དག་ཡོད་པ་དེ་ནི་མཁས་པ་རྣམས་ཀྱིས་ཀྱེ་མའོ་འདི་ནི་ཚུལ་འཆོས་པའོ། ། ཀྱེ་མའོ་འདི་ནི་ཁ་གསག་ཅན་ནོ། ། ཀྱེ་མའོ་འདི་ནི་ཆོས་སྟོར་བའོ། ། ཀྱེ་མའོ་འདི་ནི་ཀུན་ནས་ཉོན་མོངས་པའི་ཆོས་ཅན་ནོ། ། ཀྱེ་མའོ་འདི་ནི་འཇིག་རྟེན་གྱི་ཟང་ཟིང་ལྷུར་ལེན་པའོ། ། ཀྱེ་མའོ་འདི་ནི་གོས་དང་ཟས་ཆེད་ཆེར་བྱེད་པ་སྟེ། འཇིག་རྟེན་ན་རྐུན་པོར་རིག་པར་བྱའོ། ། དེ་ཅིའི་ཕྱིར་ཞེ་ན། ཤཱ་རིའི་བུ་གང་ཟག་དེ་ལྟ་བུ་ལ་ནི་དངོས་པོ་བཞི་མེད་དེ། དེའི་རྟགས་བཞི་གང་ཞེ་ན། ཟས་ལ་ཆེད་ཆེར་བྱེད་པ་ལ་གནས་པ་དང་། བདག་ལ་མཆོག་ཏུ་འདུ་ཤེས་པ་དང་། སྒྲོགས་པས་ཉེ་བར་སྟོན་པ་དང་། དེ་ལ་བྱང་ཆུབ་སེམས་དཔའི་རྩོམ་པ་གང་ཡིན་པ་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའི་ཡོན་ཏན་གྱི་གནས་གཅིག་ལ་ཡང་མངོན་པར་སྦྱོར་བ་མེད་པའོ། །
en: “Śāriputra, four qualities are not present in bodhisattvas. What are these four? Bodhisattvas are without deceit. Bodhisattvas are without miserliness. Bodhisattvas are without jealousy and slander. Bodhisattvas never lose heart, thinking, ‘I am unable to awaken in a perfect manner to unexcelled and perfect buddhahood.’ “Śāriputra, concerning those people in whom these four qualities are present, wise ones will know, ‘Oh! These people are frauds! They are flatterers! They waste the Dharma! They are wracked by afflictions! They are obsessed with worldly things! They just want more and more food and clothes! They are thieves within the world!’ Why? Because, Śāriputra, such people lack four things, and what are the four signs of this? Partaking of increasing amounts of food, perceiving themselves as supreme, teaching ostentatiously, and when it comes to undertaking the deeds of a bodhisattva, not applying themselves to develop a single bodhisattva quality.

source: ཤཱ་རིའི་བུ་བྱང་ཆུབ་སེམས་དཔས་བརྩམ་པར་བྱ་བའི་བྱང་ཆུབ་སེམས་དཔའི་ཡོན་ཏན་ཡང་གང་ཞེ་ན། འདི་ལྟ་སྟེ། ཚུལ་ཁྲིམས་ཡོངས་སུ་རྫོགས་པར་བྱེད་པ་ཉིད་དང་། ཚུལ་ཁྲིམས་མ་རལ་བ་ཉིད་དང་། དྲན་པ་ཉམས་པ་མེད་པ་ཉིད་དང་། ལྷུག་པར་གཏོང་བ་ཉིད་དང་། བཟོད་པའི་སྟོབས་དང་། ཁྲོ་བ་མེད་པ་ཉིད་དང་། འཚེ་བ་མེད་པ་ཉིད་དང་། ཐོས་པ་མང་བ་དང་། སྦྱིན་པ་དང་། དུལ་བ་དང་། ཡང་དག་པར་སྡོམ་པ་དང་། འདོད་པ་རྣམས་དོན་དུ་གཉེར་བ་མེད་པ་ཉིད་དང་། གནོད་སེམས་ཐམས་ཅད་ལ་དོན་དུ་གཉེར་བ་མེད་པ་ཉིད་དང་། མྱུར་དུ་མངོན་པར་འབྱུང་བ་ཉིད་དང་། ཕྲ་མ་མེད་པ་ཉིད་དང་། ཁྲོ་བ་མེད་པ་ཉིད་དང་། དགེ་བའི་ཆོས་ཡང་དག་པར་ལེན་པ་དང་། ཡེ་ཤེས་ཀྱི་སྤྱོད་པ་དང་། སེམས་ཅན་ཐམས་ཅད་ལ་བྱམས་པའི་སེམས་ཉིད་དང་། མི་འཐུན་པ་རྣམས་སྡུམ་པར་བྱེད་པ་དང་། འཁོར་བའི་འདམ་གྱི་ཟམ་པ་ཉིད་དང་། ཆོས་ཀྱི་གཏམ་བྱེད་པ་ཉིད་དང་། བཟོད་པའི་སྟོབས་སོ་སོར་རིག་པར་བྱེད་པ་དང་། ལས་ཀྱི་རྣམ་པར་སྨིན་པ་ལ་རྟོན་པ་ནི་ཤཱ་རིའི་བུ་ངེས་པར་བྱང་ཆུབ་སེམས་དཔར་འགྱུར་ཏེ ཤཱ་རིའི་བུ་འདི་ནི་བྱང་ཆུབ་སེམས་དཔས་བརྩམས་པའི་བྱང་ཆུབ་སེམས་དཔའི་ཡོན་ཏན་རྣམས་ཡིན་ནོ། ། ཤཱ་རིའི་བུ་གང་ལ་བྱང་ཆུབ་སེམས་དཔས་བརྩམས་པའི་བྱང་ཆུབ་སེམས་དཔའི་ཡོན་ཏན་གྱི་ཆོས་འདི་དག་མེད་པ་དེ་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་ཚུལ་འཆོས་པ་ངན་འགྲོའི་གནས་དང་ལྡན་པར་རིག་པར་བྱའོ། །
en: “Śāriputra, what are the qualities in which bodhisattvas should exert themselves? They are perfect discipline, unbroken discipline, unspoiled mindfulness, liberality, the strength of patience, the lack of aggression, the absence of harm, erudition, generosity, self-control, restraint, never indulging in sensual pleasures, never indulging in any kind of ill will, swift renunciation, the absence of slander, the lack of aggression, the adoption of what is virtuous, behaving wisely, love for all sentient beings, reconciling those in conflict, acting as bridges over saṃsāra’s mire, giving Dharma discourses, knowing the particular strengths of patience, and relying on the ripening of actions. Śāriputra, those who exert themselves in these qualities will certainly become bodhisattvas. Śāriputra, these are the qualities in which bodhisattvas exert themselves. Śāriputra, you should know that those who lack the qualities in which bodhisattvas exert themselves are frauds destined for the lower realms.

source: ཤཱ་རིའི་བུ་ཆོས་བཞི་པོ་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་སྒྲུབ་པ་ཡིན་ཏེ། བཞི་གང་ཞེ་ན། ཆོས་དང་ཆོས་ཤེས་པ་དང་། སྦྱིན་པ་དང་སྦྱིན་པ་ཤེས་པ་དང་། ཞལ་ཏ་བྱེད་པའི་བྱ་བ་ཤེས་པ་དང་། ཐོས་པ་མང་པོ་བཙལ་བ་ཤེས་པའོ། །
en: “Śāriputra, four qualities lead bodhisattvas to the accomplishment of unexcelled and perfect buddhahood. What are these four? They are the Dharma and the knowledge of the Dharma, generosity and the knowledge of generosity, the knowledge of the duties of a caretaker, and the knowledge of the pursuit of erudition.

source: ཤཱ་རིའི་བུ་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའི་ཆོས་གང་ཞེ་ན། འདི་ལྟ་སྟེ། དྲན་པ་ཉེ་བར་གཞག་པ་བཞི་དང་། ཡང་དག་པར་སྤོང་བ་བཞི་དང་། རྫུ་འཕྲུལ་གྱི་རྐང་པ་བཞི་དང་། དབང་པོ་ལྔ་དང་། སྟོབས་ལྔ་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་བདུན་དང་། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་དང་། ཆགས་པ་མེད་པ་དང་། ཞེ་སྡང་མེད་པ་དང་། གཏི་མུག་མེད་པ་དང་། དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་འདི་རྣམས་ནི་བྱང་ཆུབ་སེམས་དཔའི་ཆོས་ཞེས་བྱའོ། ། དེ་ལ་ཆོས་ཤེས་པ་གང་ཞེ་ན།
en: “Śāriputra, what are the Dharma teachings of the bodhisattvas? The Dharma teachings of the bodhisattvas are the four applications of mindfulness, the four correct exertions, the four bases of miracles, the five powers, the five strengths, the seven factors of awakening, the eightfold path of the noble ones, the absence of attachment, the absence of anger, the absence of ignorance, and the path of the ten virtuous actions.

source: གང་དེ་རྣམས་ཚུལ་བཞིན་སྒྲུབ་པར་བྱེད་ཀྱི་ལོག་པར་མི་སྒྲུབ་པ་སྟེ། སྦྱིན་པ་དང་། དུལ་བ་དང་། ཡང་དག་པར་སྡོམ་པ་འདི་ནི་ཆོས་ཤེས་པ་ཞེས་བྱའོ། ། དེ་ལ་སྦྱིན་པ་གང་ཞེ་ན། ཤཱ་རིའི་བུ་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་ལ་གང་ཡོད་པ་དེ་ཡོངས་སུ་གཏོང་བར་བྱེད་དེ། དེ་ལག་པ་ཡོངས་སུ་གཏོང་བ་ཡིན། རྐང་པ་ཡོངས་སུ་གཏོང་བ་ཡིན། ལག་པ་དང་རྐང་པ་ཡོངས་སུ་གཏོང་བ་ཡིན། སྣ་ཡོངས་སུ་གཏོང་བ་ཡིན། མགོ་ཡོངས་སུ་གཏོང་བ་ཡིན། ཡན་ལག་དང་ཉིང་ལག་ཡོངས་སུ་གཏོང་བ་ཡིན།
en: “What is the knowledge of the Dharma teachings? The knowledge of the Dharma teachings consists in practicing those teachings properly—not incorrectly—with generosity, self-control, and restraint.

source: བུ་ཡོངས་སུ་གཏོང་བ་ཡིན། བུ་མོ་ཡོངས་སུ་གཏོང་བ་ཡིན། ཆུང་མ་ཡོངས་སུ་གཏོང་བ་ཡིན། སྲོག་ཡོངས་སུ་གཏོང་བ་ཡིན། ནོར་ཡོངས་སུ་གཏོང་བ་ཡིན། བདེ་བ་ཡོངས་སུ་གཏོང་བ་ཡིན། ལུས་ཡོངས་སུ་གཏོང་བ་ཡིན།
en: “What is generosity? Śāriputra, bodhisattvas give away everything they have. They give away their arms, their legs, their hands and feet, their nose, their head, their limbs and body parts, their sons, their daughters, their spouses, their lives, their wealth, their happiness, their body, their material possessions, their lands, their jewels, and all their belongings. Śāriputra, bodhisattvas who give such gifts approach unexcelled and perfect buddhahood.

source: དངོས་པོ་ཡོངས་སུ་གཏོང་བ་ཡིན།
en: “What is the knowledge of generosity? It consists in giving alms at the appropriate time and giving appropriate offerings. It consists in giving donations of robes, alms, bedding, medicine, and requisites to monks. Śāriputra, wise bodhisattvas always turn away from inferior forms of generosity such as giving at inappropriate times, giving what is not suitable, giving liquor, giving poison, giving what is harmful, giving what is regrettable, giving weapons, giving what has been stolen, giving contemptuously, refusing to give with one’s own hands, giving while averting one’s face, giving motivated by desire, giving unpleasant gifts, improper gifts, inferior gifts, gifts mixed with poison, giving in ways that lead to harm, giving in order to profit, giving in order to inspire lasting fear, giving in ways that jeopardize awakening, giving a hangman’s noose, giving deludedly, giving in order to be served, and giving with fear.

source: ཡུལ་ཡོངས་སུ་གཏོང་བ་ཡིན། རིན་པོ་ཆེ་ཡོངས་སུ་གཏོང་བ་ཡིན། བདོག་པ་ཐམས་ཅད་ཡོངས་སུ་གཏོང་བ་ཡིན་ཏེ། ཤཱ་རིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་དེ་ལྟར་སྦྱིན་པ་སྦྱིན་ན་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལ་བསྙེན་པ་ཡིན་ནོ། ། དེ་ལ་སྦྱིན་པ་ཤེས་པ་གང་ཞེ་ན།
en: “Śāriputra, under no circumstances do the wise practice or involve themselves with those inferior forms of generosity. Bodhisattvas who practice or involve themselves with them should not be called bodhisattvas. Bodhisattvas who are endowed with bodhisattva qualities but who have spoiled their generosity are actually bereft of bodhisattva qualities.

source: ཇི་ལྟར་ལྷུང་བཟེད་དུ་ཆུད་པ་དུས་སུ་སྦྱིན་པ་དང་། རུང་བ་སྦྱིན་པ་དག་སྦྱིན་པ་སྦྱིན་པར་བྱེད་དེ། ཇི་ལྟར་དགེ་སློང་རྣམས་ལ་ཆོས་གོས་དང་། བསོད་སྙོམས་དང་། གནས་མལ་དང་། ན་བའི་གསོས་སྨན་དང་། ཡོ་བྱད་རྣམས་ཡོངས་སུ་བཏང་ཞིང་མགྲོན་དུ་གཉེར་བར་བྱེད་དོ། ། ཤཱ་རིའི་བུ་གང་ཡང་བྱང་ཆུབ་སེམས་དཔའ་མཁས་པས་སྨད་པའི་སྦྱིན་པ་འདི་རྣམས་ལས་རབ་ཏུ་ལྡོག་པ་ཡིན་ཏེ། འདི་ལྟ་སྟེ། དུས་སུ་མ་བྱིན་པའི་སྦྱིན་པ་དང་། རུང་བ་མ་ཡིན་པའི་སྦྱིན་པ་དང་། ཆང་གི་སྦྱིན་པ་དང་། དུག་གི་སྦྱིན་པ་དང་། གནོད་པའི་སྦྱིན་པ་དང་། འགྱོད་པའི་སྦྱིན་པ་དང་། མཚོན་ཆའི་སྦྱིན་པ་དང་། ཕྲོགས་པའི་སྦྱིན་པ་དང་། བརྙས་པའི་སྦྱིན་པ་དང་། རང་གི་ལག་གིས་མ་ཡིན་པའི་སྦྱིན་པ་དང་། རྒྱབ་ཀྱིས་ཕྱོགས་པའི་སྦྱིན་པ་དང་། འདོད་པ་ལ་སྟེན་པའི་སྦྱིན་པ་དང་། མི་འཐུན་པའི་སྦྱིན་པ་དང་། དམ་པ་མ་ཡིན་པའི་སྦྱིན་པ་དང་། སྨད་པའི་སྦྱིན་པ་དང་། དུག་དང་སྦྱར་བའི་སྦྱིན་པ་དང་། སོ་སོར་གནོད་པའི་སྦྱིན་པ་དང་། རྙེད་པའི་ཕྱིར་སྦྱིན་པ་དང་། རྟག་ཏུ་འཇིགས་པ་སྐྱེད་པའི་ཕྱིར་སྦྱིན་པ་དང་། བྱང་ཆུབ་ཡོངས་སུ་ཉམས་པར་བྱེད་པའི་སྦྱིན་པ་དང་། འཆི་བའི་ཞགས་པའི་སྦྱིན་པ་དང་། རྨོངས་པའི་སྦྱིན་པ་དང་། བསྟེན་པའི་ཕྱིར་སྦྱིན་པ་དང་། འཇིགས་པའི་སྦྱིན་པ་དག་ལས་ལྡོག་པར་འགྱུར་རོ། །
en: “Śāriputra, how should bodhisattvas who strive in the factors of awakening after having renounced their homes practice generosity? What should they give? How much should they give? Śāriputra, bodhisattvas who strive in the factors of awakening after having renounced their homes should remain bound by the prātimokṣa vows. Their conduct, personal associations, and behavior should be perfect. They should train by seeing danger in even the subtlest misdeeds, by engaging in pure physical, verbal, and mental actions, and by adopting a pure livelihood. They should earnestly apply themselves to the instructions they receive, to the practice of recitation, and to dwelling in the remote places. They should teach extensively what they have learned and understood to others. They should be propagators and benefactors of the Dharma.

source: ཤཱ་རིའི་བུ་འདི་ལ་མཁས་པས་སྨད་པའི་སྦྱིན་པ་གང་ཡིན་པ་དེ་དག་ལ་ཐམས་ཅད་ཀྱི་ཐམས་ཅད་དུ་མི་སྤྱོད་ཅིང་ལྷག་པར་མི་སྤྱོད་དེ་ བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཀྱི་ཐམས་ཅད་དུ་སྤྱོད་ཅིང་ལྷག་པར་སྤྱོད་པ་གང་ཡིན་པ་དེ་ནི་བྱང་ཆུབ་སེམས་དཔའ་ཞེས་བརྗོད་པར་མི་བྱའོ། །
en: “Śāriputra, compared to householder bodhisattvas who fill buddhafields as numerous as the grains of sand in the Ganges with the seven types of jewels and then offer these to the thus-gone, worthy, perfect buddhas, renunciant bodhisattvas who teach a single four-line verse produce much more merit. Śāriputra, the Thus-Gone One did not authorize renunciants to practice the giving of material things. Why? Because, Śāriputra, after having gone forth, for inconceivably countless eons they should not think about being invited to feasts where one is offered householders’ or renunciants’ robes or alms. Instead, they should maintain devotion and admiration for the Dharma alone. Why? Because, Śāriputra, my disciples should be rich in Dharma, not rich in material things.
